package AllLessons.Lesson8;

public interface Description {
   /*
   1. напишите метод который принимает в качестве параметра любую строку
   2. распеч послед символ строки
   3. проверить заканчив ли ваша строка подрстрочкой !!!
   4. проверить начинается ли ваша строка подс i like
   5. пров содержит ли ваша строка подстрочку Java
   6. найти позицию подстроки java в строке i like java
   7. заменить все символа а на о
   8. преобразуйте строку к верхнему регисту
   9. преобразуйте строку к нижнему регисту
   10. вырезать строку java "test .substring (0,2)"


   Составляем строку с помощью класса Stringbuilder
   1. дано два числа например 3 и 56., неоюходимо составить следующие строки
   3+56 = 59
   3-56 = -53
   3*56 = 168
   2. замените символ = на слово равно

   найти два средних знака строки
   даны строки разной длины(длина чет числ) необходимо вернуть ее два средних знака
   например если дана строка "string" результат будет "ri" для строки "code" результат "od"
   для "Practice"
   результат "ct"

homework
main
void sort string[]ar1
stringcompare

    */


}
